#####################################################

value = 1230340234023410
result = str(value).count('0')

#####################################################

value = 1230340234000000
result = len(str(value)) - len(str(int(str(value)[::-1])))

# # Пояснение к заданию №2:
# 1. (операция до "-") померял длинну входящего числа преобразовав его в str
# 2. (операция после "-") преобразовал число в str, развернул, преобразовал в int, ноли с переди отвалились
# вернул в str, померял длинну
# 3. разница и есть к-во нолей которые были в конце числа
# P.S. прокатит только с нолями :) халява :)

#####################################################

my_list1 = ['Привет', 'пока', 'дядя', 'как дела?', 'Вова', 'Петя', 'очень']
my_list2 = ['салют', 'хочу', 'яблоко', '100', 'Гиллель', 'баллов']

my_result = my_list1[::2] + my_list2[1::2]

#####################################################

my_list = [1, 2, 3, 4]
new_list = my_list[1:] + [my_list[0]]

#####################################################

my_list = [1, 2, 3, 4]
my_list.append(my_list.pop(0))

#####################################################

my_string = 'Не имей 100 рублей, а имей 100 друзей, хотя 102 или 198 еще лучше :)'
my_list = my_string.split()
result = 0

for index in range(len(my_list)):
    if my_list[index].isdigit():
        result += int(my_list[index])

#####################################################

my_str = 'Мы съедим побольше каши - все победы будут наши !!!'
l_limit = 'с'
r_limit = 'у'

sub_str = my_str[(my_str.find(l_limit) + 1):my_str.rfind(r_limit)]

#####################################################

my_str = '123456789'
my_list = list()

for index in range(0, len(my_str), 2):
    if index < len(my_str) - 1:
        my_list.append(my_str[index] + my_str[index + 1])
    else:
        my_list.append(my_str[index] + "_")

#####################################################

my_list = [4, 6, 1, 7, 2, 8, 2, 5, 2, 6, 7, 1, 9, 3, 5, 0, 0, 7, 2]
result = 0

for index in range(1, len(my_list) - 1):
    if my_list[index] > my_list[index - 1] + my_list[index + 1]:
        result += 1

print('Результат:', result)

#####################################################
